In [63]:
import numpy as np
import pandas as pd

In [107]:
d={'Zaragoza':pd.Series([1., 2., 3.], index=['a','b','c']), 
   'Huesca':pd.Series([4., 5., 6., 7.], index=list('abcd'))}

In [110]:
df=pd.DataFrame(d)

In [111]:
df

   Zaragoza  Huesca
a       1.0     4.0
b       2.0     5.0
c       3.0     6.0
d       NaN     7.0

In [67]:
df.columns

Index(['Zaragoza', 'Huesca'], dtype='object')

In [68]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [69]:
df.T

            a    b    c    d
Zaragoza  1.0  2.0  3.0  NaN
Huesca    4.0  5.0  6.0  7.0

In [70]:
df.size

8

In [71]:
df.shape

(4, 2)

In [72]:
df.ndim

2

In [73]:
df.isnull()

   Zaragoza  Huesca
a     False   False
b     False   False
c     False   False
d      True   False

In [74]:
df.isna()

   Zaragoza  Huesca
a     False   False
b     False   False
c     False   False
d      True   False

In [75]:
df=df.astype('string')
df.dtypes

Zaragoza    string
Huesca      string
dtype: object

In [85]:
df=df.sort_values('Zaragoza', ascending=False)
df

  Zaragoza Huesca
c      3.0    6.0
b      2.0    5.0
a      1.0    4.0
d     <NA>    7.0

In [115]:
df=df[sorted(df.columns.tolist())]
df

   Huesca  Zaragoza
a     4.0       1.0
b     5.0       2.0
c     6.0       3.0
d     7.0       NaN